package numgothai

import "testing"

func TestIntText(t *testing.T) {
	cases := []struct {
		in   int
		want string
	}{
		{1, "หนึ่ง"},
		{2, "สอง"},
		{3, "สาม"},
		{4, "สี่"},
		{5, "ห้า"},
		{6, "หก"},
		{7, "เจ็ด"},
		{8, "แปด"},
		{9, "เก้า"},
		{0, "ศูนย์"},
		{10, "สิบ"},
		{11, "สิบเอ็ด"},
		{21, "ยี่สิบเอ็ด"},
		{31, "สามสิบเอ็ด"},
		{101, "หนึ่งร้อยหนึ่ง"},
		{115, "หนึ่งร้อยสิบห้า"},
		{291, "สองร้อยเก้าสิบเอ็ด"},
		{999, "เก้าร้อยเก้าสิบเก้า"},
		{1000, "หนึ่งพัน"},
		{1001, "หนึ่งพันหนึ่ง"},
		{2001, "สองพันหนึ่ง"},
		{7601, "เจ็ดพันหกร้อยหนึ่ง"},
		{9921, "เก้าพันเก้าร้อยยี่สิบเอ็ด"},
		{10000, "หนึ่งหมื่น"},
		{10001, "หนึ่งหมื่นหนึ่ง"},
		{40000, "สี่หมื่น"},
		{100000, "หนึ่งแสน"},
		{1000000, "หนึ่งล้าน"},
		{3000000, "สามล้าน"},
		{10000000, "สิบล้าน"},
		{81000000, "แปดสิบเอ็ดล้าน"},
		{9223372036854775807, "เก้าล้านสองแสนสองหมื่นสามพันสามร้อยเจ็ดสิบสองล้านสามหมื่นหกพันแปดร้อยห้าสิบสี่ล้านเจ็ดแสนเจ็ดหมื่นห้าพันแปดร้อยเจ็ด"},
	}

	for _, testCase := range cases {
		r := IntText(testCase.in)

		if testCase.want != r {
			t.Errorf("Want %q, got %q", testCase.want, r)
		}
	}
}

func BenchmarkIntText(b *testing.B) {
	for i := 0; i < b.N; i++ {
		IntText(8223372236854775811)
	}
}
